bak_flamelet_jet_map_pilot_turb/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0    -5e-4 0)
    (3.6  -5e-4 0)
    (3.85 -5e-4 0)
    (9.1  -5e-4 0)
    (9.45 -5e-4 0)
    (108  -5e-4 0)
    (108   5e-4 0)
    (9.45  5e-4 0)
    (9.1   5e-4 0)
    (3.85  5e-4 0)
    (3.6   5e-4 0)
    (0     5e-4 0)
    (0    -5e-4 576)
    (3.6  -5e-4 576)
    (3.85 -5e-4 576)
    (9.1  -5e-4 576)
    (9.45 -5e-4 576)
    (108  -5e-4 576)
    (108   5e-4 576)
    (9.45  5e-4 576)
    (9.1   5e-4 576)
    (3.85  5e-4 576)
    (3.6   5e-4 576)
    (0     5e-4 576)
);

blocks
(
    hex (0 1 10 11 12 13 22 23) zonefuel (24 1 256) simpleGrading (0.7 1 15)
    hex (1 2 9 10 13 14 21 22) zonefuelwall (2 1 256) simpleGrading (1 1 15)
    hex (2 3 8 9 14 15 20 21) zonepilot (42 1 256) simpleGrading (1 1 15)
    hex (3 4 7 8 15 16 19 20) zonepilotwall (3 1 256) simpleGrading (1 1 15)
    hex (4 5 6 7 16 17 18 19) zonecoflow (89 1 256) simpleGrading (40 1 15)
);

edges
(
);

boundary
(
    axis
    {
        type patch;
        faces
        (
           (0 12 23 11)
        );
    }
    fuel
    {
        type patch;
        faces
        (
           (0 11 10 1)
        );
    }
    pilot
    {
        type patch;
        faces
        (
           (2 9 8 3)
        );
    }
    coflow
    {
        type patch;
        faces
        (
           (4 7 6 5)
        );
    }
    inletwall
    {
        type wall;
        faces
        (
           (1 10 9 2)
           (3 8 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
           (12 13 22 23)
           (13 14 21 22)
           (14 15 20 21)
           (15 16 19 20)
           (16 17 18 19)
        );
    }
    back
    {
        type patch;
        faces
        (
           (0 1 13 12)
           (1 2 14 13)
           (2 3 15 14)
           (3 4 16 15)
           (4 5 17 16)
        );
    }
    front
    {
        type patch;
        faces
        (
           (10 11 23 22)
           (9 10 22 21)
           (8 9 21 20)
           (7 8 20 19)
           (6 7 19 18)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
           (5 6 18 17)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
